## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this`      |
|        | `module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + enabled                                = true
      + evaluation_frequency                   = "PT10M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "canadacentral"
      + name                                   = "Breakglass Account Signin Attempt"
      + resource_group_name                    = "pubsec-central-logging-rg-prod"
      + scopes                                 = [
          + "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod",
        ]
      + severity                               = 2
      + tags                                   = {
          + "ClientOrganization" = "cds-snc"
          + "CostCenter"         = "sentinel"
          + "DataSensitivity"    = "U"
          + "ProjectContact"     = "Security@CDS"
          + "ProjectName"        = "Sentinel"
          + "TechnicalContact"   = "security@cds-snc.ca"
          + "ssc_cbrid"          = "21JA"
        }
      + window_duration                        = "PT10M"
      + workspace_alerts_storage_enabled       = false

      + criteria {
          + operator                = "GreaterThan"
          + query                   = "SigninLogs | where UserPrincipalName in ('ops1@cdssnc.onmicrosoft.com','ops2@cdssnc.onmicrosoft.com')"
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + enabled                                = true
      + evaluation_frequency                   = "PT10M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "canadacentral"
      + name                                   = "Conditional Access Policy Modification"
      + resource_group_name                    = "pubsec-central-logging-rg-prod"
      + scopes                                 = [
          + "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod",
        ]
      + severity                               = 2
      + tags                                   = {
          + "ClientOrganization" = "cds-snc"
          + "CostCenter"         = "sentinel"
          + "DataSensitivity"    = "U"
          + "ProjectContact"     = "Security@CDS"
          + "ProjectName"        = "Sentinel"
          + "TechnicalContact"   = "security@cds-snc.ca"
          + "ssc_cbrid"          = "21JA"
        }
      + window_duration                        = "PT10M"
      + workspace_alerts_storage_enabled       = false

      + criteria {
          + operator                = "GreaterThan"
          + query                   = "AuditLogs | where OperationName in (\"Update conditional access policy\", \"Add conditional access policy\", \"Delete conditional access policy\")"
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_application.sp_app[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_service_principal.sp[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
